---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SiteFailures.NotEnoughPointsInSurface
source: html/5c1fd73a-5d75-e003-200a-5378e55512ca.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SiteFailures.NotEnoughPointsInSurface Property

The surface must have at least three distinct Points.

## Syntax (C#)
```csharp
public static FailureDefinitionId NotEnoughPointsInSurface { get; }
```